Train data shape: (50000, 32, 32, 3)
Train labels shape: (50000, 10)
Test data shape: (10000, 32, 32, 3)
Test labels shape: (10000, 10)
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input.1 (InputLayer)         [(None, 32, 32, 3)]       0         
_________________________________________________________________
9 (Conv2D)                   (None, 30, 30, 16)        448       
_________________________________________________________________
10 (Activation)              (None, 30, 30, 16)        0         
_________________________________________________________________
11 (MaxPooling2D)            (None, 15, 15, 16)        0         
_________________________________________________________________
12 (Conv2D)                  (None, 13, 13, 32)        4640      
_________________________________________________________________
13 (Activation)              (None, 13, 13, 32)        0         
_________________________________________________________________
14 (MaxPooling2D)            (None, 6, 6, 32)          0         
_________________________________________________________________
15 (Conv2D)                  (None, 4, 4, 64)          18496     
_________________________________________________________________
16 (Activation)              (None, 4, 4, 64)          0         
_________________________________________________________________
17 (GlobalAveragePooling2D)  (None, 64)                0         
_________________________________________________________________
17_EXPAND1 (Lambda)          (None, 64, 1)             0         
_________________________________________________________________
17_EXPAND2 (Lambda)          (None, 64, 1, 1)          0         
_________________________________________________________________
19 (Reshape)                 (None, 64)                0         
_________________________________________________________________
20 (Dense)                   (None, 10)                650       
_________________________________________________________________
21 (Lambda)                  (None, 10)                0         
=================================================================
Total params: 24,234
Trainable params: 24,234
Non-trainable params: 0
_________________________________________________________________
  1/313 [..............................] - ETA: 38s - loss: 2.5547 - accuracy: 0.4688 50/313 [===>..........................] - ETA: 0s - loss: 3.9368 - accuracy: 0.4062 102/313 [========>.....................] - ETA: 0s - loss: 3.7909 - accuracy: 0.4130159/313 [==============>...............] - ETA: 0s - loss: 3.7054 - accuracy: 0.4163217/313 [===================>..........] - ETA: 0s - loss: 3.7045 - accuracy: 0.4139275/313 [=========================>....] - ETA: 0s - loss: 3.6635 - accuracy: 0.4139313/313 [==============================] - 0s 908us/step - loss: 3.6668 - accuracy: 0.4130
Evaluation result: Loss: 3.6667749881744385  Accuracy: 0.4129999876022339
